// Видалити з рядка всі пробіли

#include <stdio.h>
#include <string.h>

int main()
{
    char str[100];             // оголосити символьний масив для зберігання вхідного рядка
    printf("Введіть рядок: "); // введення рядка
    fgets(str, 100, stdin);    // прочитати у рядку введення користувача
    int len = strlen(str);     // обчислити довжину рядка

    for (int i = 0; i < len; i++)
    { // перебрати рядок
        if (str[i] == ' ')
        { // перевірити, чи поточний символ є пробілом

            for (int j = i; j < len; j++)
            { // якщо так, то зсунути всі наступні символи на одну позицію вліво
                str[j] = str[j + 1];
            }
            len--; // зменшити довжину рядка, щоб врахувати видалений пробіл
            i--;   // зменшити індекс циклу, щоб повернутися на ту саму позицію, якщо є кілька пропусків підряд
        }
    }
    printf("Рядок без пробілів: %s", str); // виведення результату
    return 0;
}