// Визначити індекс останнього пробілу в рядку

#include <stdio.h>
#include <string.h>

int main()
{
    char str[100];             // оголосити символьний масив для зберігання вхідного рядка
    printf("Введіть рядок: "); // введення рядка
    fgets(str, 100, stdin);    // прочитати у рядку введення користувача
    int len = strlen(str);     // обчислити довжину рядка
    int last_space_index = -1; // ініціалізувати змінну для зберігання індексу останнього пробілу
    for (int i = 0; i < len; i++)
    { // цикл проходження по рядку
        if (str[i] == ' ')
        {                         // перевірити, чи поточний символ є пробілом
            last_space_index = i; // оновити індекс останнього знайденого пробілу
        }
    }
    printf("Індекс останнього пробілу в рядку %d\n", last_space_index); // виведення результату
    return 0;
}